wrk/Отчёт
wrk2 -t4 -c128 -d180s -R2000 -s ./wrk/put.lua --latency http://localhost:8080
Running 3m test @ http://localhost:8080
  4 threads and 128 connections
  Thread calibration: mean lat.: 155.749ms, rate sampling interval: 1115ms
  Thread calibration: mean lat.: 161.062ms, rate sampling interval: 1122ms
  Thread calibration: mean lat.: 150.340ms, rate sampling interval: 1090ms
  Thread calibration: mean lat.: 151.126ms, rate sampling interval: 1107ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.33ms    4.30ms 119.68ms   98.58%
    Req/Sec   499.80      2.33   520.00     97.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.87ms
 75.000%    2.45ms
 90.000%    3.08ms
 99.000%   10.36ms
 99.900%   70.40ms
 99.990%  105.66ms
 99.999%  112.51ms
100.000%  119.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.262     0.000000            1         1.00
       0.991     0.100000        33997         1.11
       1.263     0.200000        67991         1.25
       1.477     0.300000       102032         1.43
       1.676     0.400000       135935         1.67
       1.872     0.500000       169854         2.00
       1.973     0.550000       186938         2.22
       2.079     0.600000       203983         2.50
       2.191     0.650000       221036         2.86
       2.313     0.700000       237975         3.33
       2.447     0.750000       254919         4.00
       2.521     0.775000       263394         4.44
       2.603     0.800000       271806         5.00
       2.695     0.825000       280261         5.71
       2.803     0.850000       288819         6.67
       2.925     0.875000       297277         8.00
       2.995     0.887500       301531         8.89
       3.075     0.900000       305726        10.00
       3.169     0.912500       310017        11.43
       3.285     0.925000       314209        13.33
       3.427     0.937500       318492        16.00
       3.509     0.943750       320588        17.78
       3.617     0.950000       322713        20.00
       3.741     0.956250       324844        22.86
       3.903     0.962500       326964        26.67
       4.119     0.968750       329084        32.00
       4.271     0.971875       330144        35.56
       4.471     0.975000       331199        40.00
       4.747     0.978125       332266        45.71
       5.235     0.981250       333315        53.33
       6.059     0.984375       334379        64.00
       6.675     0.985938       334907        71.11
       7.531     0.987500       335437        80.00
       8.951     0.989062       335968        91.43
      11.487     0.990625       336499       106.67
      16.671     0.992188       337030       128.00
      19.407     0.992969       337295       142.22
      23.215     0.993750       337561       160.00
      27.823     0.994531       337826       182.86
      32.623     0.995313       338091       213.33
      38.111     0.996094       338357       256.00
      40.703     0.996484       338490       284.44
      43.999     0.996875       338622       320.00
      47.999     0.997266       338757       365.71
      52.703     0.997656       338887       426.67
      57.151     0.998047       339022       512.00
      59.839     0.998242       339087       568.89
      61.727     0.998437       339153       640.00
      64.191     0.998633       339219       731.43
      66.687     0.998828       339285       853.33
      70.655     0.999023       339352      1024.00
      72.895     0.999121       339385      1137.78
      76.031     0.999219       339418      1280.00
      78.463     0.999316       339451      1462.86
      83.071     0.999414       339484      1706.67
      88.319     0.999512       339518      2048.00
      89.727     0.999561       339534      2275.56
      91.455     0.999609       339551      2560.00
      94.207     0.999658       339567      2925.71
      96.255     0.999707       339584      3413.33
      97.855     0.999756       339601      4096.00
      98.431     0.999780       339609      4551.11
      99.071     0.999805       339617      5120.00
     100.479     0.999829       339625      5851.43
     102.655     0.999854       339635      6826.67
     104.063     0.999878       339642      8192.00
     105.279     0.999890       339646      9102.22
     105.791     0.999902       339650     10240.00
     106.175     0.999915       339654     11702.86
     106.559     0.999927       339659     13653.33
     107.455     0.999939       339663     16384.00
     108.095     0.999945       339666     18204.44
     108.415     0.999951       339667     20480.00
     109.311     0.999957       339669     23405.71
     109.631     0.999963       339671     27306.67
     109.695     0.999969       339673     32768.00
     110.463     0.999973       339674     36408.89
     110.527     0.999976       339675     40960.00
     111.551     0.999979       339676     46811.43
     111.743     0.999982       339677     54613.33
     112.063     0.999985       339678     65536.00
     112.447     0.999986       339679     72817.78
     112.447     0.999988       339679     81920.00
     112.511     0.999989       339681     93622.86
     112.511     0.999991       339681    109226.67
     112.511     0.999992       339681    131072.00
     112.511     0.999993       339681    145635.56
     112.511     0.999994       339681    163840.00
     113.343     0.999995       339682    187245.71
     113.343     0.999995       339682    218453.33
     113.343     0.999996       339682    262144.00
     113.343     0.999997       339682    291271.11
     113.343     0.999997       339682    327680.00
     119.743     0.999997       339683    374491.43
     119.743     1.000000       339683          inf
#[Mean    =        2.329, StdDeviation   =        4.295]
#[Max     =      119.680, Total count    =       339683]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  359907 requests in 3.00m, 23.00MB read
Requests/sec:   1999.46
Transfer/sec:    130.82KB


PUT-запросы в течение трёх минут, где rps=2000 и 128 соединений, безошибочно отработали, сервис выдержал нагрузку.

wrk2 -t4 -c128 -d120s -R2000 -s ./wrk/get.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 128 connections
  Thread calibration: mean lat.: 3.230ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.051ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 12.656ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 12.910ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.67ms    6.01ms 127.10ms   73.44%
    Req/Sec   515.77    297.82     2.85k    64.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.06ms
 75.000%   11.86ms
 90.000%   14.39ms
 99.000%   18.62ms
 99.900%   69.06ms
 99.990%   95.36ms
 99.999%  114.37ms
100.000%  127.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.315     0.000000            1         1.00
       1.503     0.100000        21974         1.11
       2.018     0.200000        43969         1.25
       2.565     0.300000        65919         1.43
       3.667     0.400000        87895         1.67
       8.059     0.500000       109874         2.00
       9.215     0.550000       120867         2.22
      10.007     0.600000       131852         2.50
      10.647     0.650000       142907         2.86
      11.239     0.700000       153877         3.33
      11.863     0.750000       164878         4.00
      12.207     0.775000       170414         4.44
      12.583     0.800000       175864         5.00
      12.983     0.825000       181331         5.71
      13.431     0.850000       186867         6.67
      13.903     0.875000       192350         8.00
      14.143     0.887500       195073         8.89
      14.391     0.900000       197799        10.00
      14.647     0.912500       200536        11.43
      14.935     0.925000       203249        13.33
      15.263     0.937500       206047        16.00
      15.423     0.943750       207379        17.78
      15.615     0.950000       208753        20.00
      15.831     0.956250       210164        22.86
      16.063     0.962500       211508        26.67
      16.343     0.968750       212890        32.00
      16.495     0.971875       213575        35.56
      16.687     0.975000       214269        40.00
      16.911     0.978125       214943        45.71
      17.183     0.981250       215636        53.33
      17.535     0.984375       216296        64.00
      17.759     0.985938       216642        71.11
      18.047     0.987500       216986        80.00
      18.399     0.989062       217338        91.43
      18.863     0.990625       217676       106.67
      19.567     0.992188       218015       128.00
      20.047     0.992969       218187       142.22
      20.815     0.993750       218355       160.00
      22.943     0.994531       218529       182.86
      25.119     0.995313       218699       213.33
      27.535     0.996094       218870       256.00
      29.199     0.996484       218956       284.44
      32.111     0.996875       219042       320.00
      35.871     0.997266       219129       365.71
      40.191     0.997656       219215       426.67
      44.959     0.998047       219299       512.00
      50.975     0.998242       219342       568.89
      60.191     0.998437       219386       640.00
      63.103     0.998633       219429       731.43
      67.647     0.998828       219472       853.33
      69.759     0.999023       219514      1024.00
      71.487     0.999121       219538      1137.78
      72.063     0.999219       219557      1280.00
      73.471     0.999316       219578      1462.86
      75.263     0.999414       219600      1706.67
      76.223     0.999512       219622      2048.00
      76.671     0.999561       219632      2275.56
      77.439     0.999609       219644      2560.00
      79.103     0.999658       219654      2925.71
      81.151     0.999707       219664      3413.33
      84.607     0.999756       219675      4096.00
      85.823     0.999780       219680      4551.11
      86.975     0.999805       219686      5120.00
      91.391     0.999829       219692      5851.43
      93.119     0.999854       219696      6826.67
      94.911     0.999878       219703      8192.00
      95.039     0.999890       219704      9102.22
      95.423     0.999902       219707     10240.00
      97.919     0.999915       219710     11702.86
      99.839     0.999927       219712     13653.33
     103.807     0.999939       219716     16384.00
     103.807     0.999945       219716     18204.44
     105.535     0.999951       219718     20480.00
     106.303     0.999957       219719     23405.71
     106.623     0.999963       219720     27306.67
     107.775     0.999969       219722     32768.00
     107.775     0.999973       219722     36408.89
     108.799     0.999976       219723     40960.00
     112.255     0.999979       219724     46811.43
     112.255     0.999982       219724     54613.33
     113.791     0.999985       219725     65536.00
     113.791     0.999986       219725     72817.78
     114.367     0.999988       219726     81920.00
     114.367     0.999989       219726     93622.86
     114.367     0.999991       219726    109226.67
     115.519     0.999992       219727    131072.00
     115.519     0.999993       219727    145635.56
     115.519     0.999994       219727    163840.00
     115.519     0.999995       219727    187245.71
     115.519     0.999995       219727    218453.33
     127.167     0.999996       219728    262144.00
     127.167     1.000000       219728          inf
#[Mean    =        7.668, StdDeviation   =        6.009]
#[Max     =      127.104, Total count    =       219728]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  238994 requests in 2.00m, 16.56MB read
Requests/sec:   1990.54
Transfer/sec:    141.22KB

GET-запросы в течение двух минут, где rps=2000 и 128 соединений, безошибочно отработали, сервис выдержал нагрузку.

Результаты профилирования представлены на flame graphах: для PUT - cpuPut.svg, для GET - cpuGet.svg.

Результаты профилирования памяти представлены на flame graphax: для PUT - allocPut.svg, для GET - allocGet.svg.
Судя по ним, больше всего памяти выделяется для асинхронной работы CompletableFuture.

Результаты профилирования блокировок представлены на flame graphax: для PUT - lockPut.svg, для GET - lockGet.svg.
Большинство блокировок при работе с сетью.